{"id":3019,"date":"2022-10-19T10:51:48","date_gmt":"2022-10-19T10:51:48","guid":{"rendered":"https:\/\/blinkbeauty.co.za\/?p=3019"},"modified":"2022-11-03T13:10:07","modified_gmt":"2022-11-03T13:10:07","slug":"medical-tattooing-what-you-need-to-know","status":"publish","type":"post","link":"https:\/\/blinkbeauty.co.za\/medical-tattooing-what-you-need-to-know\/","title":{"rendered":"The World of Medical Tattooing: What You Need to Know"},"content":{"rendered":"<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-large is-resized\"><img decoding=\"async\" loading=\"lazy\" src=\"https:\/\/blinkbeauty.co.za\/wp-content\/uploads\/2022\/10\/Depositphotos_444575868_XL-1-1024x683.jpg\" alt=\"Medical tattoos performed at Blink Beauty Salon\" class=\"wp-image-3093\" width=\"512\" height=\"342\" srcset=\"https:\/\/blinkbeauty.co.za\/wp-content\/uploads\/2022\/10\/Depositphotos_444575868_XL-1-1024x683.jpg 1024w, https:\/\/blinkbeauty.co.za\/wp-content\/uploads\/2022\/10\/Depositphotos_444575868_XL-1-300x200.jpg 300w, https:\/\/blinkbeauty.co.za\/wp-content\/uploads\/2022\/10\/Depositphotos_444575868_XL-1-768x512.jpg 768w, https:\/\/blinkbeauty.co.za\/wp-content\/uploads\/2022\/10\/Depositphotos_444575868_XL-1-1536x1025.jpg 1536w, https:\/\/blinkbeauty.co.za\/wp-content\/uploads\/2022\/10\/Depositphotos_444575868_XL-1-2048x1366.jpg 2048w\" sizes=\"(max-width: 512px) 100vw, 512px\" \/><figcaption class=\"wp-element-caption\">Medical tattoos performed at Blink Beauty Salon<\/figcaption><\/figure><\/div>\n\n\n<p>Tattoos are no longer just a way to show off your personality or artistic side. Medical tattoos are now being used as a means of treatment for various medical conditions. While the technology is still new, it shows great promise in helping improve the lives of those suffering from certain medical conditions.<\/p>\n\n\n\n<p>This article will explore what medical tattooing is and what you need to know about it.<\/p>\n\n\n\n<h2>What Is Medical Tattooing?<\/h2>\n\n\n\n<p>Medical tattoos are simply tattoos done for medical and cosmetic purposes. Without getting too technical, medical tattoos are created using micro pigmentation. This process uses very fine needles to place pigment into the skin. The needles used for this process are much thinner than those used for traditional tattoos.<\/p>\n\n\n\n<p>The pigment is placed into the skin at a shallow depth, which is why medical tattoos are often not as noticeable as traditional tattoos. The shallow depth also means that medical tattoos are not as permanent as traditional tattoos.<\/p>\n\n\n\n<h2>Purpose of Tattoos<\/h2>\n\n\n\n<p>Many persons with critical medical problems prefer to wear alert bracelets rather than medical tattoos. Wearing a bracelet might be inconvenient, and having a medical tattoo is a simple method to ensure you never lose your bracelet again.<\/p>\n\n\n\n<p>In some radiation therapy treatments, radiation tattoos guide where the radiation should be delivered. It’s critical to keep the markings from fading between treatments.<\/p>\n\n\n\n<p>For example, after a mastectomy, areolas can be drawn to emulate the look of an existing breast. In addition, tattoo artists can use shading to correct skin pigment issues often caused by surgery.<\/p>\n\n\n\n<p>Tattoos have a variety of applications in today’s society. In recent years, we’ve seen more creative ways to use tattoos to make people feel better. We may transform sour lemons into beautiful tattoos when life gives us lemons.<\/p>\n\n\n\n<h2>Why Do People Get Medical Tattoos?<\/h2>\n\n\n\n<h3>Improve the Immune System<\/h3>\n\n\n\n<p>Tattoos can actually help improve your immune system. When you get a tattoo, your body produces antibodies to fight off the ink particles. This helps your body build up its defences against other foreign invaders, like bacteria and viruses.&nbsp;<\/p>\n\n\n\n<h3>Increase Self-Confidence<\/h3>\n\n\n\n<p>For many people, self-confidence is an issue. If you have scars or skin defects that make you feel self-conscious, getting a tattoo can help you feel better about yourself. Seeing your flaw covered up by something beautiful can give you much-needed confidence.&nbsp;<\/p>\n\n\n\n<h3>Reduces Cortisol Levels in the Body<\/h3>\n\n\n\n<p>Cortisol is often referred to as the “stress hormone.” It is released by the adrenal glands in response to stress and has been linked to numerous health problems, such as high blood pressure and anxiety. Getting a tattoo can actually help reduce cortisol levels in the body because it helps release endorphins, which have natural stress-relieving properties.&nbsp;<\/p>\n\n\n\n<h3>Tattoos Make People Feel Good<\/h3>\n\n\n\n<p>In addition to reducing stress levels, endorphins also produce feelings of happiness and well-being. So not only will a tattoo help you look good, but it will also make you feel good.<\/p>\n\n\n\n<h3>To Help with Sensation<\/h3>\n\n\n\n<p>Medical tattoos are sometimes used to help people with sensation issues. For example, people who have had mastectomies often get nipple tattoos to help recreate the sensation of having nipples. This can help them feel more comfortable in their own skin and increase their self-confidence.&nbsp;<\/p>\n\n\n\n<h3>To Cover Scars<\/h3>\n\n\n\n<p>One of the most common reasons people get medical tattoos is to cover up scars. Scars can result from surgery, injury, or burns and can be very difficult to hide. Medical tattoos can help to camouflage scars, making them less noticeable.<\/p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-full is-resized\"><img decoding=\"async\" loading=\"lazy\" src=\"https:\/\/blinkbeauty.co.za\/wp-content\/uploads\/2022\/10\/Website-Before-After-1024-×-1024-px-61-1.svg\" alt=\"Areola reconstruction\" class=\"wp-image-3094\" width=\"512\" height=\"512\"\/><\/figure><\/div>\n\n\n<h2>How to Find a Reputable Tattoo Artist for Medical Tattoos?<\/h2>\n\n\n\n<h3>Word of Mouth and Online Reviews<\/h3>\n\n\n\n<p>Word of mouth and online reviews are always a good place to start when looking for any type of service, and tattooing is no different. A good way to find out about an artist’s work portfolio and images is to check out their Instagram or Facebook page. Once you’ve looked through an artist’s portfolio, it’s important to ensure that their studio is well-maintained and clean.&nbsp;<\/p>\n\n\n\n<h3>Following Tattooing Regulations<\/h3>\n\n\n\n<p>All tattoo artists are required to follow certain regulations set forth by the&nbsp;<a target=\"_blank\" rel=\"noopener noreferrer\" class=\"editor-rtfLink\" href=\"https:\/\/www.osha.gov\/laws-regs\/standardinterpretations\/2016-06-20-0\"><u>Occupational Safety and Health Administration (OSHA)<\/u><\/a>, so be sure to ask about their safety procedures. Finally, although all reputable studios should have strict hygiene and cleanliness policies, it’s always a good idea to ask about them before getting started.&nbsp;<\/p>\n\n\n\n<h3>Hygiene\/Cleanliness<\/h3>\n\n\n\n<p>In addition to following OSHA regulations, all reputable studios should have strict hygiene and cleanliness policies. These policies help protect both the tattoo client and the artist from potential infection or disease.&nbsp;<\/p>\n\n\n\n<p>When getting a tattoo, the client should always:<\/p>\n\n\n\n<ul>\n<li><p>Wash their hands before and after the tattoo session<\/p><\/li>\n\n\n\n<li><p>Avoid touching their face or the tattoo area during the session<\/p><\/li>\n\n\n\n<li><p>Wear clean, loose-fitting clothing to their tattoo appointment<\/p><\/li>\n\n\n\n<li><p>Not smoke before or after the tattoo session<\/p><\/li>\n<\/ul>\n\n\n\n<h3>Work Portfolio &amp; Images<\/h3>\n\n\n\n<p>As mentioned earlier, one of the best ways to get an idea of an artist’s skill level is by looking at their work portfolio and images. If an artist doesn’t have a website or social media platform with examples of their work, that could be a red flag.&nbsp;<\/p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-full is-resized\"><img decoding=\"async\" loading=\"lazy\" src=\"https:\/\/blinkbeauty.co.za\/wp-content\/uploads\/2022\/10\/Website-Before-After-1024-×-1024-px-62-2.svg\" alt=\"Stretch Mark Reduction\" class=\"wp-image-3095\" width=\"512\" height=\"512\"\/><\/figure><\/div>\n\n\n<h3>Well-maintained Studio<\/h3>\n\n\n\n<p>An artist&#8217;s studio should be clean, organized, and well-lit. This will indicate how much pride the artist takes in their work and what kind of environment you can expect during your tattoo session.&nbsp;<\/p>\n\n\n\n<h3>Safety Procedures<\/h3>\n\n\n\n<p>Any reputable tattoo artist will have SLAAPed out (Sterilize\/Latex gloves\/Apron\/Auto-claves) safety procedures before starting any tattoo session. These procedures help ensure that both the client and the artist are protected from bloodborne pathogens or other dangers during the tattoo process.&nbsp;<\/p>\n\n\n\n<p>The tattoo artist should always:<\/p>\n\n\n\n<ul>\n<li><p>Wear gloves when handling tattoos and tattoo equipment.<\/p><\/li>\n\n\n\n<li><p>Use disposable needles and single-use tubes.<\/p><\/li>\n\n\n\n<li><p>Use fresh ink for each tattoo.<\/p><\/li>\n\n\n\n<li><p>Clean the tattoo area before starting the tattoo.<\/p><\/li>\n\n\n\n<li><p>Follow proper aftercare procedures.<\/p><\/li>\n<\/ul>\n\n\n\n<p>A medical tattoo is a permanent reminder of a life-changing event or diagnosis, so it’s essential to make sure you find a reputable artist who can provide you with a high-quality tattoo.&nbsp;<\/p>\n\n\n\n<h2>Aftercare for Medical Tattoos<\/h2>\n\n\n\n<p>It is important to follow the aftercare instructions provided by your tattoo artist to ensure the proper healing of your tattoo. These instructions will vary depending on the type of tattoo you have, but in general, you will be instructed to:&nbsp;<\/p>\n\n\n\n<ul>\n<li><p>Keep the tattoo clean and dry for the first week.<\/p><\/li>\n\n\n\n<li><p>Apply a thin layer of sunscreen to the tattoo when exposed to sunlight.<\/p><\/li>\n\n\n\n<li><p>Avoid swimming or soaking the tattoo in water for the first two weeks.<\/p><\/li>\n\n\n\n<li><p>Avoid picking or scratching at the tattoo.<\/p><\/li>\n\n\n\n<li><p>Gently clean the tattoo with the particular solution suggested by the tattoo artist and water it if it becomes dirty.<\/p><\/li>\n<\/ul>\n\n\n\n<p>Your medical tattoo will heal quickly and last many years with proper care.<\/p>\n\n\n\n<h2>What Type of Ink Is Used for Medical Tattoos?<\/h2>\n\n\n\n<p>Depending on the specific circumstances, medical tattooing usually employs different types of ink. For instance, many people who receive medical bracelets or have to restart their tattoos will pick either organic or traditional inks based on personal preference.<\/p>\n\n\n\n<p>Organic inks are made from natural ingredients and are therefore considered safer than traditional inks. They are also less likely to cause an allergic reaction. However, these inks are not as long-lasting as traditional inks and may fade over time.<\/p>\n\n\n\n<p>The following are used to make colours in traditional ink:<\/p>\n\n\n\n<ul>\n<li><p>Nickel for black<\/p><\/li>\n\n\n\n<li><p>Mercury for red<\/p><\/li>\n\n\n\n<li><p>Inorganic metal salts<\/p><\/li>\n\n\n\n<li><p>Chromium for green<\/p><\/li>\n\n\n\n<li><p>Polycyclic aromatic hydrocarbons (PAHs)<\/p><\/li>\n\n\n\n<li><p>Aluminium pigments<\/p><\/li>\n\n\n\n<li><p>Lead for yellow, green or white<\/p><\/li>\n<\/ul>\n\n\n\n<h2>FAQs on Medical Tattooing<\/h2>\n\n\n\n<p><strong>Do medical tattoos fade?&nbsp;<\/strong><\/p>\n\n\n\n<p>Medical tattoos are made with pigments crafted to be long-lasting and resist fading over time. However, like all tattoos, medical tattoos will eventually fade. The rate at which your tattoo fades will depend on several factors, such as your skin type, the location of the tattoo, and how often you are exposed to the sun.&nbsp;<\/p>\n\n\n\n<p><strong>Who can perform medical tattoos?<\/strong><\/p>\n\n\n\n<p>A licensed esthetician or cosmetic tattoo artist can perform medical tattoos.&nbsp;<\/p>\n\n\n\n<p><strong>What is tattoo pain comparable to?&nbsp;<\/strong><\/p>\n\n\n\n<p>The pain of getting a tattoo varies from person to person. It is often described as scratching or burning sensation. You may consider taking a pain reliever before your appointment if you have low pain tolerance.&nbsp;<\/p>\n\n\n\n<p>When tattooing, the technician will insert the needle into your skin repeatedly. The sensation is similar to getting a series of tiny scratches. If you have ever had your eyebrows waxed, getting a medical tattoo will likely hurt less than that! Always be sure to ask about numbing options if you are concerned about pain.&nbsp;&nbsp;<\/p>\n\n\n\n<p><strong>What should I practice when tattooing?&nbsp;<\/strong><\/p>\n\n\n\n<p>You should always practice good hygiene when getting a medical tattoo by washing your hands thoroughly and avoiding touching your face unnecessarily. You should also avoid tanning or using self-tanner prior to your appointment, as this can affect the colour of your tattoo. Finally, be sure to eat something before your appointment so that you are not lightheaded during the procedure.&nbsp;<\/p>\n\n\n\n<p><strong>How long does tattoo sickness last?&nbsp;<\/strong><\/p>\n\n\n\n<p>After getting a medical tattoo, it is normal for the area to feel hot and look red and swollen for the first 24 hours. You may also experience some bruising, crusting, and peeling in the days following your procedure. These side effects will usually resolve within 8 weeks. If they last longer or you develop a fever, be sure to contact your doctor.&nbsp;<\/p>\n\n\n\n<p><strong>Do tattoos affect the immune system?&nbsp;<\/strong><\/p>\n\n\n\n<p>A new tattoo causes your immune system to go into overdrive, triggering white blood cells called macrophages to eat invaders and sacrifice themselves. Additionally, your body launches what immunologists refer to as an adaptive response.<\/p>\n\n\n\n<p><strong>Does tattoo ink go into blood?&nbsp;<\/strong><\/p>\n\n\n\n<p>No, the ink stays in the dermis, the second layer of skin. It could go into veins and, thus the bloodstream if the artist goes too deep, but that’s not common.<\/p>\n\n\n\n<p><strong>Are medical tattoos permanent?&nbsp;<\/strong><\/p>\n\n\n\n<p>Yes, medical tattoos are considered permanent. However, with new technologies, there are now options for semi-permanent or even temporary medical tattoos.&nbsp;<\/p>\n\n\n\n<p><strong>What is the most painful body part to tattoo?&nbsp;<\/strong><\/p>\n\n\n\n<p>This varies from person to person, but generally, areas with thinner skin tend to be more sensitive. This includes the fingers, hands, feet, ribs, and spine.&nbsp;<\/p>\n\n\n\n<p><strong>What colours last longest in a tattoo?&nbsp;<\/strong><\/p>\n\n\n\n<p>Black and grey colours generally last the longest in a tattoo. This is because they absorb more light than lighter colours. Tattoos can fade over time regardless of colour, though, so it’s important to take care of your skin if you want your tattoo to look its best for as long as possible.<\/p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-full is-resized\"><img decoding=\"async\" loading=\"lazy\" src=\"https:\/\/blinkbeauty.co.za\/wp-content\/uploads\/2022\/10\/Website-Before-After-1024-×-1024-px-63-1.svg\" alt=\"Scalp Micropigmentation\" class=\"wp-image-3096\" width=\"512\" height=\"512\"\/><\/figure><\/div>\n\n\n<h2>Conclusion<\/h2>\n\n\n\n<p>Medical tattoos are a popular way to create permanent makeup or to camouflage scars and other skin irregularities. The pigments used in medical tattoos are created to be long-lasting, but they will eventually fade.<\/p>\n\n\n\n<p>But, with proper care, you can enjoy your medical tattoo for many years to come!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Tattoos are no longer just a way to show off your personality or artistic side. Medical tattoos are now being used as a means of treatment for various medical conditions. While the technology is still new, it shows great promise in helping improve the lives of those suffering from certain medical conditions. This article will [&hellip;]<\/p>\n","protected":false},"author":8,"featured_media":3093,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[47,29],"tags":[25,24,26],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v19.5 (Yoast SEO v19.10) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>What is Medical Tattooing? | Skin Permanent Makeup | Blink beauty<\/title>\n<meta name=\"description\" content=\"If you&#039;re considering a medical tattoo, read this first. Then, learn about the types of medical tattoos, the procedure, and aftercare tips.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/blinkbeauty.co.za\/medical-tattooing-what-you-need-to-know\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"The World of Medical Tattooing: What You Need to Know\" \/>\n<meta property=\"og:description\" content=\"If you&#039;re considering a medical tattoo, read this first. Then, learn about the types of medical tattoos, the procedure, and aftercare tips.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/blinkbeauty.co.za\/medical-tattooing-what-you-need-to-know\/\" \/>\n<meta property=\"og:site_name\" content=\"Blink Beauty\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/ChooseBlink.PMU\/\" \/>\n<meta property=\"article:published_time\" content=\"2022-10-19T10:51:48+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-11-03T13:10:07+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/blinkbeauty.co.za\/wp-content\/uploads\/2022\/10\/Depositphotos_444575868_XL-1-scaled.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"2560\" \/>\n\t<meta property=\"og:image:height\" content=\"1708\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"niel@eliteinc.com\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"niel@eliteinc.com\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"What is Medical Tattooing? | Skin Permanent Makeup | Blink beauty","description":"If you're considering a medical tattoo, read this first. Then, learn about the types of medical tattoos, the procedure, and aftercare tips.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/blinkbeauty.co.za\/medical-tattooing-what-you-need-to-know\/","og_locale":"en_US","og_type":"article","og_title":"The World of Medical Tattooing: What You Need to Know","og_description":"If you're considering a medical tattoo, read this first. Then, learn about the types of medical tattoos, the procedure, and aftercare tips.","og_url":"https:\/\/blinkbeauty.co.za\/medical-tattooing-what-you-need-to-know\/","og_site_name":"Blink Beauty","article_publisher":"https:\/\/www.facebook.com\/ChooseBlink.PMU\/","article_published_time":"2022-10-19T10:51:48+00:00","article_modified_time":"2022-11-03T13:10:07+00:00","og_image":[{"width":2560,"height":1708,"url":"https:\/\/blinkbeauty.co.za\/wp-content\/uploads\/2022\/10\/Depositphotos_444575868_XL-1-scaled.jpg","type":"image\/jpeg"}],"author":"niel@eliteinc.com","twitter_card":"summary_large_image","twitter_misc":{"Written by":"niel@eliteinc.com","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/blinkbeauty.co.za\/medical-tattooing-what-you-need-to-know\/#article","isPartOf":{"@id":"https:\/\/blinkbeauty.co.za\/medical-tattooing-what-you-need-to-know\/"},"author":{"name":"niel@eliteinc.com","@id":"https:\/\/blinkbeauty.co.za\/#\/schema\/person\/be991fd12f6e1272532770aa77f4710f"},"headline":"The World of Medical Tattooing: What You Need to Know","datePublished":"2022-10-19T10:51:48+00:00","dateModified":"2022-11-03T13:10:07+00:00","mainEntityOfPage":{"@id":"https:\/\/blinkbeauty.co.za\/medical-tattooing-what-you-need-to-know\/"},"wordCount":1858,"publisher":{"@id":"https:\/\/blinkbeauty.co.za\/#organization"},"keywords":["Areola Reconstruction","Medical Tattooing","Scalp Micropigmentation"],"articleSection":["Medical Tattooing","Permanent Makeup"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/blinkbeauty.co.za\/medical-tattooing-what-you-need-to-know\/","url":"https:\/\/blinkbeauty.co.za\/medical-tattooing-what-you-need-to-know\/","name":"What is Medical Tattooing? | Skin Permanent Makeup | Blink beauty","isPartOf":{"@id":"https:\/\/blinkbeauty.co.za\/#website"},"datePublished":"2022-10-19T10:51:48+00:00","dateModified":"2022-11-03T13:10:07+00:00","description":"If you're considering a medical tattoo, read this first. Then, learn about the types of medical tattoos, the procedure, and aftercare tips.","breadcrumb":{"@id":"https:\/\/blinkbeauty.co.za\/medical-tattooing-what-you-need-to-know\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/blinkbeauty.co.za\/medical-tattooing-what-you-need-to-know\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/blinkbeauty.co.za\/medical-tattooing-what-you-need-to-know\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/blinkbeauty.co.za\/"},{"@type":"ListItem","position":2,"name":"The World of Medical Tattooing: What You Need to Know"}]},{"@type":"WebSite","@id":"https:\/\/blinkbeauty.co.za\/#website","url":"https:\/\/blinkbeauty.co.za\/","name":"Blink Beauty","description":"Blink Beauty – Permanent makeup, laser hair removal, microneedling, lashes and other aesthetic procedures","publisher":{"@id":"https:\/\/blinkbeauty.co.za\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/blinkbeauty.co.za\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/blinkbeauty.co.za\/#organization","name":"Blink Beauty","url":"https:\/\/blinkbeauty.co.za\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/blinkbeauty.co.za\/#\/schema\/logo\/image\/","url":"https:\/\/blinkbeauty.co.za\/wp-content\/uploads\/2022\/09\/blink-final-logo-2022-RGB-transparent-png-no-tagline-2048x768-1.png","contentUrl":"https:\/\/blinkbeauty.co.za\/wp-content\/uploads\/2022\/09\/blink-final-logo-2022-RGB-transparent-png-no-tagline-2048x768-1.png","width":2048,"height":768,"caption":"Blink Beauty"},"image":{"@id":"https:\/\/blinkbeauty.co.za\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.instagram.com\/blinkbeauty\/?hl=en","https:\/\/www.facebook.com\/ChooseBlink.PMU\/"]},{"@type":"Person","@id":"https:\/\/blinkbeauty.co.za\/#\/schema\/person\/be991fd12f6e1272532770aa77f4710f","name":"niel@eliteinc.com","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/blinkbeauty.co.za\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/a5143e9dfca06413d719d8c26be102d8?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/a5143e9dfca06413d719d8c26be102d8?s=96&d=mm&r=g","caption":"niel@eliteinc.com"}}]}},"_links":{"self":[{"href":"https:\/\/blinkbeauty.co.za\/wp-json\/wp\/v2\/posts\/3019"}],"collection":[{"href":"https:\/\/blinkbeauty.co.za\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/blinkbeauty.co.za\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/blinkbeauty.co.za\/wp-json\/wp\/v2\/users\/8"}],"replies":[{"embeddable":true,"href":"https:\/\/blinkbeauty.co.za\/wp-json\/wp\/v2\/comments?post=3019"}],"version-history":[{"count":3,"href":"https:\/\/blinkbeauty.co.za\/wp-json\/wp\/v2\/posts\/3019\/revisions"}],"predecessor-version":[{"id":3503,"href":"https:\/\/blinkbeauty.co.za\/wp-json\/wp\/v2\/posts\/3019\/revisions\/3503"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/blinkbeauty.co.za\/wp-json\/wp\/v2\/media\/3093"}],"wp:attachment":[{"href":"https:\/\/blinkbeauty.co.za\/wp-json\/wp\/v2\/media?parent=3019"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/blinkbeauty.co.za\/wp-json\/wp\/v2\/categories?post=3019"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/blinkbeauty.co.za\/wp-json\/wp\/v2\/tags?post=3019"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}